"""アンチ配座の1,2-ジクロロエタンの構造最適化
"""

import psi4

psi4.set_num_threads(14)
psi4.set_memory('20GB')

# ログファイルの設定
psi4.set_output_file('DCE_anti.log')

# anti配座の分子を定義
dce_anti = psi4.geometry('''
0 1
C       -4.7565813125     -0.0715651139     -0.0312842044
C       -3.2368352322     -0.0032837663      0.0312840387
H       -5.1034202802     -1.0830926821      0.2687419304
H       -5.1034205619      0.1391627311     -1.0651107286
Cl      -5.4702549705      1.1317615051      1.0713658164
Cl      -2.5231615744     -1.2066103447     -1.0713660266
H       -2.8899959804     -0.2140116390      1.0651105567
H       -2.8899962667      1.0082438103     -0.2687420691
''')

# 構造最適化
psi4.optimize('hf/sto-3g', molecule=dce_anti)

# 最適化構造を出力
print(dce_anti.save_string_xyz())

# 最適化構造をXYZファイルとして保存
dce_anti.save_xyz_file('dce_anti.xyz', True)