"""トランス型アミドの構造最適化
"""

import psi4

psi4.set_num_threads(14)
psi4.set_memory('20GB')

# ログファイルの設定
psi4.set_output_file('amide_trans.log')

# トランス型アミドを定義
amide_trans = psi4.geometry('''
0 1
C       -3.7098485198     -0.3873709111      0.0075198021
C       -2.2161209604     -0.5156039410      0.0174313797
H       -4.1174176889     -0.8479074919     -0.9167016561
H       -4.0140291615      0.6808053138      0.0390995026
H       -4.1344285447     -0.9062342937      0.8923386237
O       -1.5258331167      0.4935451068      0.0564569839
N       -1.6406778483     -1.7443753645     -0.0167727078
H       -2.2310225548     -2.5885815756     -0.0495401112
C       -0.2091301745     -1.9100381894     -0.0086522692
H        0.0239171398     -1.3703365067     -0.7563056337
H       -0.1502044449     -1.2104184268      0.9847325102
H       -0.1084673908     -2.4996883295     -0.0623493244
''')

# 構造最適化
psi4.optimize('hf/sto-3g', molecule=amide_trans)

# 最適化構造を出力
print(amide_trans.save_string_xyz())

# 最適化構造をXYZファイルとして保存
amide_trans.save_xyz_file('amide_trans.xyz', True)