"""シス型アミドの構造最適化
"""

import psi4

psi4.set_num_threads(14)
psi4.set_memory('20GB')

# ログファイルの設定
psi4.set_output_file('amide_cis.log')

# 計算オプションを指定
psi4.set_options({'FULL_HESS_EVERY': 0})

# cis型アミドを定義
amide_cis = psi4.geometry('''
0 1
C       -1.8393520698      0.5395360054      0.0201416776
C       -0.3360665111      0.5163043932     -0.0431352068
H       -2.2621883973     -0.0970101712     -0.7851531402
H       -2.2211245617      1.5739335314     -0.1177698104
H       -2.1824800965      0.1717236862      1.0098177487
O        0.2533796400      1.5709822841     -0.2272103410
N        0.3883166009     -0.6304019690      0.0963770346
C       -0.1804129128     -1.9455644721      0.3185298065
H        1.4169544822     -0.5706164842      0.0417502268
H       -1.2868042702     -1.9408789470      0.3669547691
H        0.2053650601     -2.3536998162      1.2759269597
H        0.1261793516     -2.6206949891     -0.5074292733
''')

# 構造最適化
psi4.optimize('hf/sto-3g', molecule=amide_cis)

# 最適化構造を出力
print(amide_cis.save_string_xyz())

# 最適化構造をXYZファイルとして保存
amide_cis.save_xyz_file('amide_cis.xyz', True)